tutorials/compressible/nexaFoam/neTCLib/bluntedCone/0/TVib
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      TVib;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "initialConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $TVibValue;

boundaryField
{
    inlet
    {
        // Supersonic inflow: TVib fixed at freestream value.
        // In the undisturbed freestream TVib = TTR = T_inf = 144.4 K —
        // the gas has had sufficient time to reach thermal equilibrium
        // far from the body.
        type            fixedValue;
        value           uniform $TVibValue;
    }

    cone
    {
        type            fixedValue;
        value           uniform $TwallValue;
    }

    wedge1
    {
        type            wedge;
    }

    wedge2
    {
        type            wedge;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
